Управление_пожарной_частью_/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НазначенныеРоли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.Роли</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_пожарной_частью_/src/Enums/Роли/Роли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Роли</name>
  <enumValues>
    <name>СистемныйАдминистратор</name>
  </enumValues>
  <enumValues>
    <name>НачальникКараула</name>
  </enumValues>
  <enumValues>
    <name>Инструктор</name>
  </enumValues>
  <enumValues>
    <name>Кладовщик</name>
  </enumValues>
</mdclass:Enum>

Управление_пожарной_частью_/src/Catalogs/Пользователи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    // Поиск существующего пользователя ИБ по уникальному идентификатору
    ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.УникальныйИдентификатор);
    
    // Если пользователь не найден - создаем нового
    Если ПользовательИБ = Неопределено Тогда
        ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
        ПользовательИБ.Имя = ТекущийОбъект.Логин;
        ПользовательИБ.ПолноеИмя = ТекущийОбъект.Наименование;
        ПользовательИБ.ПоказыватьВСпискеВыбора = Истина;
    КонецЕсли;
    
    // Устанавливаем пароль (проверяем, что пароль заполнен)
    Если Не ПустаяСтрока(ТекущийОбъект.Пароль) Тогда
        ПользовательИБ.Пароль = ТекущийОбъект.Пароль;
    КонецЕсли;
    
    // Очищаем старые роли
    ПользовательИБ.Роли.Очистить();
    
    // Добавляем роли из табличной части
    Для Каждого СтрокаТЧ Из ТекущийОбъект.НазначенныеРоли Цикл
        Если СтрокаТЧ.Роль = Перечисления.Роли.СистемныйАдминистратор Тогда
            ПользовательИБ.Роли.Добавить(Метаданные.Роли.СистемныйАдминистратор);
        ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.Кладовщик Тогда
            ПользовательИБ.Роли.Добавить(Метаданные.Роли.Кладовщик);
        ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.НачальникКараула Тогда
            ПользовательИБ.Роли.Добавить(Метаданные.Роли.НачальникКараула);
        ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.Инструктор Тогда
            ПользовательИБ.Роли.Добавить(Метаданные.Роли.Инструктор);
        КонецЕсли;
    КонецЦикла;
    
    // Записываем пользователя ИБ
    Попытка
        ПользовательИБ.Записать();
    Исключение
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Ошибка при записи пользователя: " + ОписаниеОшибки();
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецПопытки;
    
    // Сохраняем уникальный идентификатор для связи
    ТекущийОбъект.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
    
КонецПроцедуры
